let a = 5 > 3 ? 'მეტი' : 'ნაკლები'
let b = 10 === 10 ? 'ტოლია' : 'არ არის ტოლი'
let c = 7 % 2 === 0 ? 'ლუწია' : 'კენტია'
let d = 'GOA' === 'GOA' ? true : false
let e = 15 > 20 ? 'დიდია' : 15 === 20 ? 'ტოლია' : 'ნაკლებია'
let f = (3 > 2 && 2 > 1) ? 'მართალია' : 'არასწორია'
let g = [1,2,3].length === 3 ? 'სამია' : 'სხვაა'
let h = (typeof 42 === 'number') ? 42 * 2 : 0
let i = (false ? 'არა' : (true ? 'კი' : 'არცერთი'))
let j = (a === 'მეტი' && b === 'ტოლია') ? 'ორივე სწორია' : 'ერთ-ერთი ან ორივე არასწორია'