name = input("type your name: ")
print("hello" + " " + name + "!")
info = input("type about yourself: ")
password = "nodo2013" 
password1 = input("type your password")
print(password == password1)
print(True and False) #აქ false-ს იმიტომ გამოიტანს რომ ამ მაგალითში არ არის ორივე პირობა შესრულებული როგორიცაა მაგალითად დედამ გითხრას რომ ამოიტანე პური და ფანტა მაგრამ შენ ამოიტან მხოლოდ ფანტას და დედას დავალებას ვერ შეასრულებ. ასე არის ზუსტად and ოპერატორი გამოყენებული და თუ ორივეს მიუტან ანუ ორივეს TRUE ტერმინალზე true-ს გამოიტანს.
print(True or False) #ამ შემთხვევაში გამოიტანს True-ს რადგან or ოპერატორი ნიშნავს ან-ს ანუ ერთი პირობა მაინც უნდა დაკმაყოფილდეს. მაგალითად როგორც დედამ გითხრა რომ ამოიტანე დაჭრილი პური ან დაუჭრელი პურიო. ის გთხოვს რომელიმე ამოიტანეო, და შენ თუ ამოიტან მაგალითად დაჭრილ პურს პირობა მაინც შესრულდება. კიდევ კოდში თუ ორივეს ამოიტან მაინც არაფერი დაშავდება, მაგრამ თუ არაგერს კოდი განოიტანს False-ს. ანუ პირობა ვერ შეასრულე.
print(5 < 2)
print(3>1)
print(5 == 5)
print(24675675435674645423563643566446346 > 2380830217849018348014)
print(2314781047891893789123895792283298478289 == 138923195495743255656462374)

age = input("type your age: ")

print(age == 10)
