#for ციკლი: გამოიყენება მაშინ, როდესაც ვიცით, რამდენჯერ უნდა შესრულდეს ციკლი. while ციკლი: გამოიყენება მაშინ, როდესაც არ ვიცით წინასწარ, რამდენჯერ უნდა შესრულდეს ციკლი.


# ორიგინალი პაროლი
original_password = "my_secure_password"

# მომხმარებლისგან პაროლის მოთხოვნა
user_input = input("შეიყვანეთ პაროლი: ")

# while ციკლი, რომელიც ხანგრძლივდება სანამ პაროლი არ დაემთხვევა ორიგინალ პაროლს
while user_input != original_password:
    print("არასწორი პაროლი. სცადეთ კიდევ.")
    user_input = input("შეიყვანეთ პაროლი: ")

print("პაროლი სწორია!")
