#flowchart-flowchart-ი არის ფოტოთი სქემის სახით შედგენილი ალგორითმი.
#ფსევდოკოდი-ალგორითმი რომელიც ჰგავს კოდს მაგრამ გამარტივებულია.
#natural language-ჩვეულებრივი ენით შედგენილი ალგრითმი. ანუ ჩვეულებრივი სიტყვებით.
#ალგორიტთმი-ნაბიჯ-ნაბიჯ ინსტრუქციები დავალებების შესასრუებლად. მაგალითად ტორტის გასაკეთებლად რეცეპტში წერია რომ უნდა გავტეხოთ კვერცხი, ჩავასხათ თასში დავამატოთ ფქვილი და შევწვათ 2 საათით. ან მაგალითად თუ გვინდა გავაკეთოდ ორიგამი გემი ფურცელი ორად უნდა გადავკეცოთ შემდეგ კიდე შუაზე გავკეცოთ, მერე კი მარცხნისკენ ფურცელი გადავკეცოთ. ანდაც მაგალითად თუ კვერცის ომლეტი გვინდა ჯერ კვერცხი უნდა ავთქვიფოთ შემდეგ კიდევ ტაფაზე შევქვათ.






for i in range(0,11):
    print(i)

for i in range(50,151):
    print(i)

for i in range(200,501,2):
    print(i)


for i in range(1,51,2):
    print(i)

#ჩვენ for loopს მაშინ ვიყენებთ როდესაც გვსურს რომ ტერმინალზე გამოვიტანოთ გარკვეული რაოდენობის რიცხვები ან სიტყვები. 