# 10 ელემენტიანი სიის შექმნა
numbers = [3, 7, 12, 18, 21, 25, 30, 41, 50, 60]

# ბოლო და პირველი ელემენტის ჯამი
მიმატება = numbers[0] + numbers[-1]

print("პირველი ელემენტი:", numbers[0])
print("ბოლო ელემენტი:", numbers[-1])
print("მათი ჯამი:", მიმატება)


#Slicing გამოიყენება მონაცემთა სტრუქტურიდან (მაგ., სია, სტრიქონი) კონკრეტული ნაწილის ამოსაღებად.


#ფუნქციები კოდის ხელახლა გამოყენებისა და ორგანიზებისთვისაა.






# პირველი რიცხვი არის 10
number = 10

# სანამ რიცხვი 70-ზე ნაკლები ან ტოლია, ციკლი იმუშავებს
while number <= 70:
    print(number)  # გამოვიტანთ რიცხვს ეკრანზე
    number = number + 2  # ვამატებთ 2-ს, რომ გადავიდეთ შემდეგ ლუწ რიცხვზე



# ვიწყებთ რიცხვით 50
number = 50

# სანამ რიცხვი 0-ზე მეტია ან ტოლია, ციკლი იმუშავებს
while number >= 0:
    print(number)  # გამოვიტანთ რიცხვს ეკრანზე
    number = number - 1  # რიცხვს ვაკლებთ 1-ს, რომ გადავიდეთ შემდეგზე





# 5 სახელის სია
names = ["მარი", "გიორგი", "ანა", "დავით", "ლიკა"]

# მესამე სახელის შეცვლა თქვენს სახელით
names[2] = "ნოდო"

print(names)







